# vsoPrmName2WidgetID

## Description
```pascal
FUNCTION vsoPrmName2WidgetID(
				recName         : STRING;
				paramName       : STRING;
				VAR outWidgetID : LONGINT) : BOOLEAN;
```

```python

def vs.vsoPrmName2WidgetID(recName, paramName):
    return (BOOLEAN, outWidgetID)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|recName|STRING||
|paramName|STRING||
|outWidgetID|LONGINT||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events